{
  "en": {
    "introduce": "INTRODUCE",
    "hero_title": "Building Comprehensive",
    "hero_subtitle": "Digital Solutions",
    "description": "I am a Full Stack Developer creating tailored solutions for every project.",
    "available_for_work": "Available for work",
    "full_time_job": "Full Time Job",
    "project_based_work": "Project-based Work",
    "contact_me": "CONTACT ME",
    "portfolio": "PORTFOLIO",
    "featured_projects": "Featured Projects",
    "portfolio_description": "I build projects that are not only visually appealing but also highly functional and ready for deployment. I ensure each project is crafted with precision and attention to detail, delivering seamless user experiences and robust backend solutions.",
    "more_projects": "More Projects",
    "web_developer": "Web Developer",
    "react_developer": "React Developer",
    "dotnet_developer": ".Net Developer",
    "country": "Country",
    "turkey": "Turkey",
    "city": "City",
    "istanbul": "Istanbul",
    "date_of_birth": "Date Of Birth",
    "skills": "Skills",
    "download_cv": "DOWNLOAD CV",
    "about_me": "ABOUT ME",
    "about": "About",
    "me": "Me",
    "introduction": "Hi, my name is",
    "education_description": " I graduated from Sakarya University's Information Systems Engineering department in 2024. I have knowledge and experience in React JS, .NET, .NET Core, ASP.NET, and MSSQL. Using these technologies, I have developed various projects and delivered application solutions. Additionally, I successfully completed a course offered by the Sakarya University Continuous Education Center and received a B1 level English proficiency certificate.",
    "phone": "Phone",
    "email": "Email",
    "language": "Language",
    "github": "Github",
    "linkedin": "Linkedin",
    "years_of_experience": "Years Of Experience",
    "handled_projects": "Handled Projects",
    "open_source_libraries": "Open Source Libraries",
    "loading": "Loading...",
    "error": "Error",
    "blog": "BLOG",
    "latest": "Latest",
    "blogs": "Blogs",
    "blog_description": "In my blog, I share the latest trends and tips in technology, covering web development, software engineering, and user experience design. From JavaScript frameworks to .NET and React best practices, you'll find valuable insights and resources to enhance your skills and stay ahead in the tech world.",
    "read_more": "Read More",
    "more_blog": "More Blog",
    "contact": "Contact",
    "contactme": "Me",
    "contact_description": "I design products that are more than pretty. I make them shippable and usable, tempor non mollit dolor et do aute.",
    "location": "Location",
    "contactemail": "E-mail",
    "contactphone": "Phone",
    "name": "Name",
    "message": "Message",
    "send_message": "Send Message",
    "skillsskills": "SKILLS",
    "my": "My",
    "advantages": "Advantages",
    "skills_description": "I create products that are not only aesthetically pleasing but also functional and ready for deployment. With expertise in React, .NET, MSSQL, HTML, CSS, and JavaScript, I ensure that every aspect of your project is handled with precision and care.",
    "services": "SERVICES",
    "servicemy": "My",
    "services_description": "I offer a range of services to help bring your ideas to life, from design to development and beyond.",
    "web_development": "Web Development",
    "web_development_description": "I create professional web applications using React. My solutions are efficient and user-friendly.",
    "backend_api_development": "Backend API Development",
    "backend_api_development_description": "I develop robust backend APIs using ASP.NET Core and .NET Core to ensure seamless integration and functionality.",
    "end_to_end_solutions": "End-to-End Solutions",
    "end_to_end_solutions_description": "I deliver end-to-end solutions, from initial design to final deployment, ensuring a smooth and efficient process.",
    "database_design_optimization": "Database Design and Optimization",
    "database_design_optimization_description": "I design and optimize databases to ensure data integrity, performance, and scalability.",
    "project_details": "Project Details",
    "law_office_website": "Law Office Website",
    "project_thumbnail_image": "Project Thumbnail Image",
    "client": "CLIENT",
    "services2": "SERVICES",
    "web_design_development": "Web Design and Development",
    "backend_integration": "Backend Integration",
    "database_management": "Database Management",
    "project_links": "PROJECT LINKS",
    "project_description": "Project Description",
    "project_description_content": "In this project, we aim to create a comprehensive platform that addresses these complex issues while providing valuable resources and tools for users. Our platform is designed to be multilingual, user-friendly, and highly functional, ensuring that all users can access the information they need in their preferred language.",
    "language_options": "Language Options",
    "language_options_description": "Language options are available for all pages and incoming data in the project. A translation.json file is created for static data. Separate columns are maintained for each language for the data from the database, allowing dynamic extraction and display of data according to the current language selection.",
    "blog_area": "Blog Area",
    "blog_area_description": "The blog section on the site is dynamically created using data from the database. Users can read blog posts in their native language.",
    "faq_section": "Frequently Asked Questions (FAQ)",
    "faq_section_description": "The FAQ section is managed dynamically with data from the database. Answers to the most frequently asked questions are presented here.",
    "admin_panel": "Admin Panel",
    "admin_panel_description": "A user-friendly admin panel was developed for managing blog and FAQ content, allowing for easy content updates.",
    "form_integration": "Form Integration",
    "form_integration_description": "Form units on the page are integrated with SMTP, enabling users to fill out forms and receive responses via email. This ensures fast and secure communication.",
    "coinmarketcap_api_integration": "CoinMarketCap API Integration",
    "project_description_content_crypto": "Our platform is a cutting-edge cryptocurrency project designed to offer users real-time access to cryptocurrency prices, portfolio management, and the latest news in the crypto world. Our user-friendly interface, built with React and leveraging the Coinmarketcap API, allows users to seamlessly manage their assets and stay informed.",
    "user_operations": "User Operations",
    "user_operations_description": "User registration, login, and balance management functions are included. Balance management displays both cash balance and cryptocurrency portfolio, allowing users to easily track their total assets and crypto investments.",
    "news_area": "News Area",
    "news_area_description": "The news area allows for the dynamic creation and display of news articles. News is fetched from the database and displayed according to the user's language preference.",
    "project_development_with_react": "Project Development with React",
    "project_development_with_react_description": "The project is developed using React, leveraging modern web development technologies to ensure a user-friendly interface and high performance.",
    "real_time_price_information": "Real-Time Price Information",
    "real_time_price_information_description": "The platform fetches real-time price information by making requests to the Coinmarketcap API. This allows users to access the latest cryptocurrency prices.",
    "technologies": "Technologies",
    "resume": "Resume",
    "work_experience": "Work Experience",
    "my_education": "My Education",
    "company_dataliva": "Dataliva",
    "date_dataliva": "July, 2024 - Current",
    "position_dataliva": "Software Developer",
    "description_dataliva": "I specialize in .NET and SQL technologies. I develop, maintain, and enhance applications using the .NET framework (C#, ASP.NET, .NET Core). Additionally, I write database queries, stored procedures, and functions using T-SQL, aiming to improve database performance. We leverage these technologies to meet service requirements and deliver high-performance solutions.",
    "company_architecht": "Architecht",
    "date_architecht": "August-2023 - March-2024",
    "position_architecht": "Software Developer",
    "description_architecht": "I have worked on projects involving .NET, .NET Core, ASP.NET, React, MSSQL, HTML, and CSS. Additionally, I have developed WPF screens, providing comprehensive solutions across various technologies and platforms.",
    "institution_sakarya": "Sakarya University",
    "date_sakarya": "2020-2024",
    "degree_sakarya": "Information System Engineering",
    "description_sakarya": "I graduated from my university's Information Systems Engineering department. I worked on projects involving .NET, .NET Core, ASP.NET, React, MSSQL, HTML and CSS. I have also developed extensive applications across various technologies and platforms.",
    "ContactEmail": "E-mail",
    "ContactLocation": "Location",
    "Contact": "Phone",
    "ReadMore": "Read More",
    "rent-a-car-project": "Rent A Car Website",
    "car_client": "Personal",
    "project_description_content_car": "In this project, we developed an application that provides car rental services. Using ASP.NET Core and Razor Pages technologies, we created a modern platform that allows users to easily manage their car rental processes. The key features of the application are listed below:",
    "car_content_1_title": "User Login and Registration Screens",
    "car_content_1_description": "User login and registration screens have been created to allow users access to the system. Once users register with the system, they can perform car rental transactions. Security measures such as authentication and password protection are implemented for secure login processes.",
    "car_content_2_title": "Car Information and Rental",
    "car_content_2_description": "Users can browse and rent available cars. Detailed information, features, and pricing are provided for each car. Users can select a car that suits their needs and make a reservation.",
    "car_content_3_title": "Payment System Integration",
    "car_content_3_description": "Payments are securely processed through the Iyzico payment system. Users can pay the rental fee using credit cards or other suitable payment methods. All necessary measures are taken to ensure the security of user data during payment transactions.",
    "car_content_4_title": "Admin Panel",
    "car_content_4_description": "The application includes an admin panel where admin users can update car information, add new cars, and manage rental transactions. The admin panel contains all the necessary functionalities to ensure the system runs smoothly and stays up-to-date. This application aims to make the car rental process fast, secure, and convenient for users. With its user-friendly interface and secure payment processes, it offers a comprehensive solution that meets the needs of both customers and the business.",
    "aylin_toys_ecommerce_platform": "Aylin Toys E-Commerce Platform",
    "aylin_toys": "Aylin Toys",
    "overview": "Overview",
    "project_description_content_toys": "The Aylin Toys E-Commerce Platform is developed using ASP.NET Core API for backend services and React for the front end. This combination offers a secure and intuitive shopping experience, allowing users to explore, wishlist, and purchase toys through a user-friendly interface. The design follows a minimalist approach to enhance user engagement and simplify navigation.",
    "ui_features": "User Interface",
    "ui_features_description": "Account Management: Enables users to manage their profiles, view transaction history, update payment methods, and edit personal information. Product Exploration: Provides detailed views of each product, including features, pricing, and customer reviews, to help make informed purchasing decisions. Favorites: Allows users to bookmark their favorite products for easy access later.",
    "functionality": "Functionality",
    "functionality_description": "Displays organized product categories for easy browsing. Enables smooth addition of products to the shopping cart and wishlist. Offers up-to-date information on product availability and prices.",
    "security_session_management": "Security and Session Management",
    "security_session_management_description": "Utilizes modern authentication protocols for secure session management. Protects user information and transaction details throughout the shopping process."
  },
  "tr": {
    "introduce": "TANITIM",
    "hero_title": "Kapsamlı",
    "hero_subtitle": "Dijital Çözümler Üretiyorum",
    "description": "Her proje için özel çözümler üreten bir Full Stack Geliştiricisiyim.",
    "available_for_work": "Çalışmaya hazır",
    "full_time_job": "Tam Zamanlı İş",
    "project_based_work": "Proje Bazlı Çalışma",
    "contact_me": "BANA ULAŞIN",
    "portfolio": "PORTFÖY",
    "featured_projects": "Öne Çıkan Projeler",
    "portfolio_description": "Sadece görsel olarak çekici değil, aynı zamanda yüksek işlevselliğe sahip ve dağıtıma hazır projeler geliştiriyorum. Her projenin hassasiyetle ve ayrıntılara dikkat edilerek hazırlandığından emin olarak, kesintisiz kullanıcı deneyimleri ve güçlü backend çözümleri sunuyorum.",
    "more_projects": "Daha Fazla Proje",
    "web_developer": "Web Geliştiricisi",
    "react_developer": "React Geliştiricisi",
    "dotnet_developer": ".Net Geliştiricisi",
    "country": "Ülke",
    "turkey": "Türkiye",
    "city": "Şehir",
    "istanbul": "İstanbul",
    "date_of_birth": "Doğum Tarihi",
    "skills": "Beceriler",
    "download_cv": "CV İNDİR",
    "about_me": "HAKKIMDA",
    "about": " ",
    "me": "Hakkımda",
    "introduction": " ",
    "education_description": " 2024 yılında Sakarya Üniversitesi Bilişim Sistemleri Mühendisliği bölümünden mezun oldum. React JS, .NET, .NET Core, ASP.NET ve MSSQL konularında bilgi birikimi ve tecrübeye sahibim. Bu teknolojileri kullanarak çeşitli projeler geliştirdim ve uygulama çözümleri sundum. Ayrıca, Sakarya Üniversitesi Sürekli Eğitim Merkezi tarafından verilen kursu başarıyla tamamlayarak B1 seviyesinde İngilizce yeterlilik sertifikası aldım.",
    "phone": "Telefon",
    "email": "E-posta",
    "language": "Dil",
    "github": "Github",
    "linkedin": "Linkedin",
    "years_of_experience": "Yıllık Deneyim",
    "handled_projects": "Tamamlanan Projeler",
    "open_source_libraries": "Açık Kaynak Kütüphaneler",
    "loading": "Yükleniyor...",
    "error": "Hata",
    "blog": "BLOG",
    "latest": " ",
    "blogs": "Blog Yazılarım",
    "blog_description": "Blogumda, teknoloji alanındaki en son trendleri ve ipuçlarını paylaşıyorum; web geliştirme, yazılım mühendisliği ve kullanıcı deneyimi tasarımı gibi konuları kapsıyorum. JavaScript çerçevelerinden .NET ve React en iyi uygulamalarına kadar, becerilerinizi geliştirmek ve teknoloji dünyasında öne geçmek için değerli bilgiler ve kaynaklar bulacaksınız.",
    "read_more": "Devamını Oku",
    "more_blog": "Daha Fazla Blog",
    "contact": " ",
    "contactme": "İletişim",
    "contact_description": "Ürünleri sadece güzel değil, aynı zamanda kullanışlı ve sevk edilebilir hale getiriyorum.",
    "location": "Lokasyon",
    "contactemail": "E-posta",
    "contactphone": "Telefon",
    "name": "İsim",
    "message": "Mesaj",
    "send_message": "Mesaj Gönder",
    "skillsskills": "YETENEKLER",
    "my": " ",
    "advantages": "Yetkinliklerim",
    "skills_description": "Ürünleri sadece estetik olarak hoş değil, aynı zamanda işlevsel ve dağıtıma hazır hale getiriyorum. React, .NET, MSSQL, HTML, CSS ve JavaScript konularındaki uzmanlığım ile projenizin her yönünü titizlikle ele alıyorum.",
    "services": "Hizmetlerim",
    "servicemy": " ",
    "services_description": "Fikirlerinizi hayata geçirmek için tasarımdan geliştirmeye ve ötesine kadar geniş bir hizmet yelpazesi sunuyorum.",
    "web_development": "Web Geliştirme",
    "web_development_description": "React kullanarak profesyonel web uygulamaları oluşturuyorum. Çözümlerim verimli ve kullanıcı dostudur.",
    "backend_api_development": "Backend API Geliştirme",
    "backend_api_development_description": "ASP.NET Core ve .NET Core kullanarak güçlü backend API'leri geliştiriyorum, sorunsuz entegrasyon ve işlevsellik sağlıyorum.",
    "end_to_end_solutions": "Uçtan Uca Çözümler",
    "end_to_end_solutions_description": "İlk tasarımdan son dağıtıma kadar sorunsuz ve verimli bir süreç sağlayarak uçtan uca çözümler sunuyorum.",
    "database_design_optimization": "Veritabanı Tasarımı ve Optimizasyonu",
    "database_design_optimization_description": "Veri bütünlüğünü, performansı ve ölçeklenebilirliği sağlamak için veritabanlarını tasarlıyor ve optimize ediyorum.",
    "project_details": "Proje Detayları",
    "law_office_website": "Hukuk Bürosu Web Sitesi",
    "project_thumbnail_image": "Proje Küçük Resim",
    "client": "MÜŞTERİ",
    "services2": "HİZMETLER",
    "web_design_development": "Web Tasarımı ve Geliştirme",
    "backend_integration": "Backend Entegrasyonu",
    "database_management": "Veritabanı Yönetimi",
    "project_links": "PROJE LİNKLERİ",
    "project_description": "Proje Açıklaması",
    "project_description_content": "Bu projede, kullanıcılar için değerli kaynaklar ve araçlar sunarken bu karmaşık sorunları ele alan kapsamlı bir platform oluşturmayı amaçlıyoruz. Platformumuz çok dilli, kullanıcı dostu ve son derece işlevsel olacak şekilde tasarlanmıştır, böylece tüm kullanıcılar tercih ettikleri dilde ihtiyaç duydukları bilgilere erişebilirler.",
    "language_options": "Dil Seçenekleri",
    "language_options_description": "Projede tüm sayfalar ve gelen veriler için dil seçenekleri mevcuttur. Statik veriler için bir translation.json dosyası oluşturulmuştur. Veritabanından gelen veriler için her dil için ayrı sütunlar tutulur, bu da verilerin mevcut dil seçimine göre dinamik olarak çıkarılmasına ve görüntülenmesine olanak tanır.",
    "blog_area": "Blog Alanı",
    "blog_area_description": "Sitedeki blog bölümü veritabanından alınan veriler kullanılarak dinamik olarak oluşturulmuştur. Kullanıcılar blog yazılarını kendi ana dillerinde okuyabilirler.",
    "faq_section": "Sıkça Sorulan Sorular (SSS)",
    "faq_section_description": "SSS bölümü, veritabanından alınan verilerle dinamik olarak yönetilir. En sık sorulan soruların yanıtları burada sunulur.",
    "admin_panel": "Yönetici Paneli",
    "admin_panel_description": "Blog ve SSS içeriğini yönetmek için kullanıcı dostu bir yönetici paneli geliştirilmiştir, bu da kolay içerik güncellemeleri sağlar.",
    "form_integration": "Form Entegrasyonu",
    "form_integration_description": "Sayfadaki form birimleri SMTP ile entegre edilmiştir, kullanıcıların formları doldurmasına ve yanıtları e-posta yoluyla almasına olanak tanır. Bu, hızlı ve güvenli iletişim sağlar.",
    "coinmarketcap_api_integration": "CoinMarketCap API Entegrasyonu",
    "project_description_content_crypto": "Platformumuz, kullanıcılara kripto para fiyatlarına, portföy yönetimine ve kripto dünyasındaki en son haberlere gerçek zamanlı erişim sunmak için tasarlanmış ileri düzey bir kripto para projesidir. React ile geliştirilmiş kullanıcı dostu arayüzümüz ve Coinmarketcap API'si ile kullanıcılar varlıklarını sorunsuz bir şekilde yönetebilir ve güncel kalabilirler.",
    "user_operations": "Kullanıcı İşlemleri",
    "user_operations_description": "Kullanıcı kaydı, giriş ve bakiye yönetimi işlevleri dahil edilmiştir. Bakiye yönetimi, hem nakit bakiyesini hem de kripto para portföyünü gösterir ve kullanıcıların toplam varlıklarını ve kripto yatırımlarını kolayca takip etmelerini sağlar.",
    "news_area": "Haber Alanı",
    "news_area_description": "Haber alanı, dinamik olarak haber makaleleri oluşturmaya ve görüntülemeye olanak tanır. Haberler veritabanından alınır ve kullanıcının dil tercihlerine göre görüntülenir.",
    "project_development_with_react": "React ile Proje Geliştirme",
    "project_development_with_react_description": "Proje, kullanıcı dostu bir arayüz ve yüksek performans sağlamak için modern web geliştirme teknolojilerinden yararlanarak React kullanılarak geliştirilmiştir.",
    "real_time_price_information": "Gerçek Zamanlı Fiyat Bilgisi",
    "real_time_price_information_description": "Platform, Coinmarketcap API'sine yapılan taleplerle gerçek zamanlı fiyat bilgilerini getirir. Bu, kullanıcılara en son kripto para fiyatlarına erişim sağlar.",
    "technologies": "Kullanılan Teknolojiler",
    "resume": "Özgeçmiş",
    "work_experience": "İş Deneyimlerim",
    "my_education": "Eğitimim",
    "company_dataliva": "Dataliva",
    "date_dataliva": "Temmuz, 2024 - Şu Anda",
    "position_dataliva": "Yazılım Geliştirici",
    "description_dataliva": ".NET framework (ASP.NET, .NET Core) kullanarak uygulamaları geliştiriyorum, bakımını yapıyorum ve iyileştiriyorum. Ayrıca, veritabanı performansını artırmayı hedefleyen T-SQL kullanarak veritabanı sorguları, saklı yordamlar ve fonksiyonlar yazıyorum. Bu teknolojileri hizmet gereksinimlerini karşılamak ve yüksek performanslı çözümler sunmak için kullanıyoruz.",
    "company_architecht": "Architecht",
    "date_architecht": "Ağustos-2023 - Mart-2024",
    "position_architecht": "Yazılım Geliştirici",
    "description_architecht": ".NET, .NET Core, ASP.NET, React, MSSQL, HTML ve CSS ile projelerde çalıştım. Ayrıca, çeşitli teknolojiler ve platformlarda kapsamlı çözümler sunarak WPF ekranları geliştirdim.",
    "institution_sakarya": "Sakarya Üniversitesi",
    "date_sakarya": "2020-2024",
    "degree_sakarya": "Bilişim  Sistemleri Mühendisliği",
    "description_sakarya": "Sakarya Üniversitesi Bilişim Sistemleri Mühendisliği bölümünden mezun oldum. .NET, .NET Core, ASP.NET, React, MSSQL, HTML ve CSS içeren projelerde çalıştım. Ayrıca, çeşitli teknolojiler ve platformlarda kapsamlı uygulamalar geliştirdim.",
    "ContactEmail": "E-posta",
    "ContactLocation": "Konum",
    "ContactPhone": "Telefon",
    "ReadMore": "Oku",
    "rent-a-car-project": "Araç Kiralama Sitesi",
    "car_client": "Kişisel Proje",
    "project_description_content_car": "Bu projede, araç kiralama hizmeti sunan bir uygulama geliştirdik. ASP.NET Core ve Razor Pages teknolojileri kullanılarak, kullanıcıların araç kiralama süreçlerini kolayca yönetebileceği modern bir platform oluşturuldu. Uygulamanın temel özellikleri aşağıdaki gibi sıralanmıştır:",
    "car_content_1_title": "Kullanıcı Giriş ve Kayıt Ekranları",
    "car_content_1_desciption": "Kullanıcıların sisteme erişimini sağlamak amacıyla kullanıcı giriş ve kayıt ekranları oluşturulmuştur. Kullanıcılar, sisteme kayıt olduktan sonra araç kiralama işlemlerini gerçekleştirebilirler. Güvenli giriş işlemleri için kimlik doğrulama ve parola koruması gibi güvenlik önlemleri uygulanmıştır.",
    "car_content_2_title": "Araç Bilgileri ve Kiralama",
    "car_content_2_desciption": "Kullanıcılar, mevcut araçları inceleyebilir ve kiralayabilirler. Her bir araç için detaylı bilgiler, özellikler ve fiyat bilgileri sunulmaktadır. Kullanıcılar, ihtiyaçlarına uygun aracı seçerek rezervasyon yapabilirler.",
    "car_content_3_title": "Ödeme Sistemi Entegrasyonu",
    "car_content_3_desciption": "Ödemeler, güvenli bir şekilde Iyzico ödeme sistemi aracılığıyla gerçekleştirilmektedir. Kullanıcılar, kredi kartı veya diğer uygun ödeme yöntemlerini kullanarak kiralama ücretini ödeyebilirler. Ödeme işlemleri sırasında kullanıcı verilerinin güvenliği için gerekli tüm önlemler alınmıştır.",
    "car_content_4_title": "Yönetim Paneli",
    "car_content_4_desciption": "Uygulamada, admin kullanıcılar için araç bilgilerini güncelleyebilecekleri, yeni araçlar ekleyebilecekleri ve kiralama işlemlerini yönetebilecekleri bir yönetim paneli bulunmaktadır. Yönetim paneli, sistemin düzgün çalışması ve güncel kalması için gereken tüm işlevleri içermektedir.Bu uygulama, araç kiralama sürecini kullanıcılar için hızlı, güvenli ve kullanışlı hale getirmeyi amaçlamaktadır. Kullanıcı dostu arayüzü ve güvenli ödeme işlemleri ile hem müşterilerin hem de işletmenin ihtiyaçlarını karşılayan kapsamlı bir çözüm sunulmaktadır.",
    "aylin_toys_ecommerce_platform": "Aylin Oyuncakları E-Ticaret Platformu",
    "aylin_toys": "Aylin Oyuncakları",
    "overview": "Genel Bakış",
    "project_description_content_toys": "Aylin Oyuncakları E-Ticaret Platformu, arka uç hizmetleri için ASP.NET Core API ve ön uç için React kullanılarak geliştirilmiştir. Bu kombinasyon, kullanıcıların oyuncakları keşfetmelerine, favorilere eklemelerine ve kullanıcı dostu bir arayüz aracılığıyla satın almalarına olanak tanıyan güvenli ve sezgisel bir alışveriş deneyimi sunar. Tasarım, kullanıcı etkileşimini artırmak ve navigasyonu basitleştirmek için minimalist bir yaklaşıma sahiptir.",
    "ui_features": "Kullanıcı Arayüzü",
    "ui_features_description": "Hesap Yönetimi: Kullanıcıların profillerini yönetmelerini, işlem geçmişini görüntülemelerini, ödeme yöntemlerini güncellemelerini ve kişisel bilgilerini düzenlemelerini sağlar. Ürün Keşfi: Her bir ürünün özellikleri, fiyatlandırma ve müşteri yorumları gibi detaylı görünümler sunarak bilinçli satın alma kararları vermeye yardımcı olur. Favoriler: Kullanıcıların favori ürünlerini daha sonra kolayca erişmek üzere işaretlemelerine olanak tanır.",
    "functionality": "İşlevsellik",
    "functionality_description": "Kolay gezinme için düzenli ürün kategorileri gösterir. Ürünlerin alışveriş sepetine ve favorilere kolayca eklenmesini sağlar. Ürünlerin bulunabilirliği ve fiyatları hakkında güncel bilgiler sunar.",
    "security_session_management": "Güvenlik ve Oturum Yönetimi",
    "security_session_management_description": "Güvenli oturum yönetimi için modern kimlik doğrulama protokollerini kullanır. Alışveriş süreci boyunca kullanıcı bilgilerini ve işlem ayrıntılarını korur."
  }
}
